{"doc_id": "D001", "text": "Locals and students alike enjoy punting boats called Stocherkähne. Cyclists weave through the old town, where cars are largely forbidden. The university dates back to the 15th century and shapes the town's rhythm. Cyclists weave through the old town, where cars are largely forbidden. Tübingen sits picturesquely on the Neckar River. The observatory atop the castle hill hosts public stargazing nights. Cyclists weave through the old town, where cars are largely forbidden. Locals and students alike enjoy punting boats called Stocherkähne. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee.\n\nThe Neckarinsel becomes a picnic hotspot as soon as spring arrives. A vibrant farmers' market fills the Marktplatz every Saturday morning. Autumn paints the surrounding Schönbuch forest in fiery reds. The Hölderlin Tower commemorates the Romantic poet who lived here. Cyclists weave through the old town, where cars are largely forbidden. Tübingen sits picturesquely on the Neckar River. Winters are chilly but Christmas lights make the streets glow warmly. Tübingen sits picturesquely on the Neckar River."}
{"doc_id": "D002", "text": "The university dates back to the 15th century and shapes the town's rhythm. Every June, the Stocherkahn race turns the town into a festive carnival. The university dates back to the 15th century and shapes the town's rhythm. The town's mix of medieval timber‑frame houses and modern labs is striking. The town's mix of medieval timber‑frame houses and modern labs is striking. The town's mix of medieval timber‑frame houses and modern labs is striking. The Hölderlin Tower commemorates the Romantic poet who lived here.\n\nAutumn paints the surrounding Schönbuch forest in fiery reds. The colourful façades along the riverfront are a photographer's dream. The observatory atop the castle hill hosts public stargazing nights. Cyclists weave through the old town, where cars are largely forbidden. Locals and students alike enjoy punting boats called Stocherkähne. The university dates back to the 15th century and shapes the town's rhythm. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Winters are chilly but Christmas lights make the streets glow warmly."}
{"doc_id": "D003", "text": "Cyclists weave through the old town, where cars are largely forbidden. The Hölderlin Tower commemorates the Romantic poet who lived here. Tübingen sits picturesquely on the Neckar River. The university dates back to the 15th century and shapes the town's rhythm. The Hölderlin Tower commemorates the Romantic poet who lived here. A vibrant farmers' market fills the Marktplatz every Saturday morning. Cyclists weave through the old town, where cars are largely forbidden. Locals and students alike enjoy punting boats called Stocherkähne. Every June, the Stocherkahn race turns the town into a festive carnival.\n\nThe Neckarinsel becomes a picnic hotspot as soon as spring arrives. The colourful façades along the riverfront are a photographer's dream. Autumn paints the surrounding Schönbuch forest in fiery reds. Philosopher Hegel once studied within these very streets. The university dates back to the 15th century and shapes the town's rhythm. The Hölderlin Tower commemorates the Romantic poet who lived here. Locals and students alike enjoy punting boats called Stocherkähne. Locals and students alike enjoy punting boats called Stocherkähne."}
{"doc_id": "D004", "text": "The observatory atop the castle hill hosts public stargazing nights. Tübingen sits picturesquely on the Neckar River. Tübingen sits picturesquely on the Neckar River. The university dates back to the 15th century and shapes the town's rhythm. Cyclists weave through the old town, where cars are largely forbidden. Locals and students alike enjoy punting boats called Stocherkähne. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The observatory atop the castle hill hosts public stargazing nights. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The university dates back to the 15th century and shapes the town's rhythm.\n\nCyclists weave through the old town, where cars are largely forbidden. A vibrant farmers' market fills the Marktplatz every Saturday morning. The town's mix of medieval timber‑frame houses and modern labs is striking. Locals and students alike enjoy punting boats called Stocherkähne. A vibrant farmers' market fills the Marktplatz every Saturday morning. The Neckarinsel becomes a picnic hotspot as soon as spring arrives."}
{"doc_id": "D005", "text": "The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The university dates back to the 15th century and shapes the town's rhythm. Winters are chilly but Christmas lights make the streets glow warmly. The colourful façades along the riverfront are a photographer's dream. Every June, the Stocherkahn race turns the town into a festive carnival.\n\nThe university dates back to the 15th century and shapes the town's rhythm. Autumn paints the surrounding Schönbuch forest in fiery reds. A vibrant farmers' market fills the Marktplatz every Saturday morning. Philosopher Hegel once studied within these very streets. Philosopher Hegel once studied within these very streets."}
{"doc_id": "D006", "text": "The colourful façades along the riverfront are a photographer's dream. Every June, the Stocherkahn race turns the town into a festive carnival. The town's mix of medieval timber‑frame houses and modern labs is striking. The colourful façades along the riverfront are a photographer's dream. Every June, the Stocherkahn race turns the town into a festive carnival. Winters are chilly but Christmas lights make the streets glow warmly.\n\nThe town's mix of medieval timber‑frame houses and modern labs is striking. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Winters are chilly but Christmas lights make the streets glow warmly. The town's mix of medieval timber‑frame houses and modern labs is striking. Locals and students alike enjoy punting boats called Stocherkähne. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Tübingen sits picturesquely on the Neckar River."}
{"doc_id": "D007", "text": "Cyclists weave through the old town, where cars are largely forbidden. The Hölderlin Tower commemorates the Romantic poet who lived here. Winters are chilly but Christmas lights make the streets glow warmly. Locals and students alike enjoy punting boats called Stocherkähne. Philosopher Hegel once studied within these very streets. Cyclists weave through the old town, where cars are largely forbidden.\n\nCafés spill onto cobblestone alleys offering Swabian pretzels and coffee. A vibrant farmers' market fills the Marktplatz every Saturday morning. Philosopher Hegel once studied within these very streets. The Hölderlin Tower commemorates the Romantic poet who lived here. Tübingen sits picturesquely on the Neckar River. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The town's mix of medieval timber‑frame houses and modern labs is striking. The Hölderlin Tower commemorates the Romantic poet who lived here."}
{"doc_id": "D008", "text": "Winters are chilly but Christmas lights make the streets glow warmly. Cyclists weave through the old town, where cars are largely forbidden. The Hölderlin Tower commemorates the Romantic poet who lived here. The Hölderlin Tower commemorates the Romantic poet who lived here. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The colourful façades along the riverfront are a photographer's dream.\n\nThe Neckarinsel becomes a picnic hotspot as soon as spring arrives. The colourful façades along the riverfront are a photographer's dream. Autumn paints the surrounding Schönbuch forest in fiery reds. The university dates back to the 15th century and shapes the town's rhythm. Autumn paints the surrounding Schönbuch forest in fiery reds. A vibrant farmers' market fills the Marktplatz every Saturday morning. Winters are chilly but Christmas lights make the streets glow warmly. Tübingen sits picturesquely on the Neckar River."}
{"doc_id": "D009", "text": "Locals and students alike enjoy punting boats called Stocherkähne. Locals and students alike enjoy punting boats called Stocherkähne. The colourful façades along the riverfront are a photographer's dream. A vibrant farmers' market fills the Marktplatz every Saturday morning. The Hölderlin Tower commemorates the Romantic poet who lived here.\n\nA vibrant farmers' market fills the Marktplatz every Saturday morning. Tübingen sits picturesquely on the Neckar River. Autumn paints the surrounding Schönbuch forest in fiery reds. The colourful façades along the riverfront are a photographer's dream. Philosopher Hegel once studied within these very streets. The colourful façades along the riverfront are a photographer's dream. Philosopher Hegel once studied within these very streets. A vibrant farmers' market fills the Marktplatz every Saturday morning."}
{"doc_id": "D010", "text": "The Hölderlin Tower commemorates the Romantic poet who lived here. A vibrant farmers' market fills the Marktplatz every Saturday morning. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The university dates back to the 15th century and shapes the town's rhythm. Tübingen sits picturesquely on the Neckar River.\n\nWinters are chilly but Christmas lights make the streets glow warmly. Every June, the Stocherkahn race turns the town into a festive carnival. The Hölderlin Tower commemorates the Romantic poet who lived here. Locals and students alike enjoy punting boats called Stocherkähne. Locals and students alike enjoy punting boats called Stocherkähne."}
{"doc_id": "D011", "text": "The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The Hölderlin Tower commemorates the Romantic poet who lived here. Winters are chilly but Christmas lights make the streets glow warmly. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Philosopher Hegel once studied within these very streets. Philosopher Hegel once studied within these very streets. Cyclists weave through the old town, where cars are largely forbidden.\n\nThe Neckarinsel becomes a picnic hotspot as soon as spring arrives. Autumn paints the surrounding Schönbuch forest in fiery reds. The university dates back to the 15th century and shapes the town's rhythm. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The colourful façades along the riverfront are a photographer's dream."}
{"doc_id": "D012", "text": "The colourful façades along the riverfront are a photographer's dream. A vibrant farmers' market fills the Marktplatz every Saturday morning. Locals and students alike enjoy punting boats called Stocherkähne. Locals and students alike enjoy punting boats called Stocherkähne. The university dates back to the 15th century and shapes the town's rhythm. The colourful façades along the riverfront are a photographer's dream. Autumn paints the surrounding Schönbuch forest in fiery reds. Philosopher Hegel once studied within these very streets. Philosopher Hegel once studied within these very streets.\n\nThe town's mix of medieval timber‑frame houses and modern labs is striking. Locals and students alike enjoy punting boats called Stocherkähne. Philosopher Hegel once studied within these very streets. Every June, the Stocherkahn race turns the town into a festive carnival. The town's mix of medieval timber‑frame houses and modern labs is striking. The university dates back to the 15th century and shapes the town's rhythm. The colourful façades along the riverfront are a photographer's dream. Cyclists weave through the old town, where cars are largely forbidden. Cyclists weave through the old town, where cars are largely forbidden."}
{"doc_id": "D013", "text": "The town's mix of medieval timber‑frame houses and modern labs is striking. Winters are chilly but Christmas lights make the streets glow warmly. The colourful façades along the riverfront are a photographer's dream. Tübingen sits picturesquely on the Neckar River. Every June, the Stocherkahn race turns the town into a festive carnival. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. A vibrant farmers' market fills the Marktplatz every Saturday morning. The colourful façades along the riverfront are a photographer's dream. The observatory atop the castle hill hosts public stargazing nights.\n\nThe colourful façades along the riverfront are a photographer's dream. The Hölderlin Tower commemorates the Romantic poet who lived here. Cyclists weave through the old town, where cars are largely forbidden. Tübingen sits picturesquely on the Neckar River. Tübingen sits picturesquely on the Neckar River. Winters are chilly but Christmas lights make the streets glow warmly. The observatory atop the castle hill hosts public stargazing nights."}
{"doc_id": "D014", "text": "The observatory atop the castle hill hosts public stargazing nights. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Every June, the Stocherkahn race turns the town into a festive carnival. The observatory atop the castle hill hosts public stargazing nights. Cyclists weave through the old town, where cars are largely forbidden. The observatory atop the castle hill hosts public stargazing nights.\n\nThe observatory atop the castle hill hosts public stargazing nights. The town's mix of medieval timber‑frame houses and modern labs is striking. The colourful façades along the riverfront are a photographer's dream. The Hölderlin Tower commemorates the Romantic poet who lived here. A vibrant farmers' market fills the Marktplatz every Saturday morning. Locals and students alike enjoy punting boats called Stocherkähne. The observatory atop the castle hill hosts public stargazing nights."}
{"doc_id": "D015", "text": "Tübingen sits picturesquely on the Neckar River. Winters are chilly but Christmas lights make the streets glow warmly. The Hölderlin Tower commemorates the Romantic poet who lived here. The university dates back to the 15th century and shapes the town's rhythm. Winters are chilly but Christmas lights make the streets glow warmly. Tübingen sits picturesquely on the Neckar River. A vibrant farmers' market fills the Marktplatz every Saturday morning. Every June, the Stocherkahn race turns the town into a festive carnival. The observatory atop the castle hill hosts public stargazing nights.\n\nPhilosopher Hegel once studied within these very streets. Autumn paints the surrounding Schönbuch forest in fiery reds. The colourful façades along the riverfront are a photographer's dream. Autumn paints the surrounding Schönbuch forest in fiery reds. The university dates back to the 15th century and shapes the town's rhythm. Cyclists weave through the old town, where cars are largely forbidden. Tübingen sits picturesquely on the Neckar River."}
{"doc_id": "D016", "text": "Tübingen sits picturesquely on the Neckar River. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The town's mix of medieval timber‑frame houses and modern labs is striking. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The Hölderlin Tower commemorates the Romantic poet who lived here. Philosopher Hegel once studied within these very streets. A vibrant farmers' market fills the Marktplatz every Saturday morning. The colourful façades along the riverfront are a photographer's dream. A vibrant farmers' market fills the Marktplatz every Saturday morning.\n\nThe town's mix of medieval timber‑frame houses and modern labs is striking. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Cyclists weave through the old town, where cars are largely forbidden. Philosopher Hegel once studied within these very streets. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The university dates back to the 15th century and shapes the town's rhythm. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Autumn paints the surrounding Schönbuch forest in fiery reds."}
{"doc_id": "D017", "text": "The university dates back to the 15th century and shapes the town's rhythm. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The university dates back to the 15th century and shapes the town's rhythm. The colourful façades along the riverfront are a photographer's dream. The observatory atop the castle hill hosts public stargazing nights. Every June, the Stocherkahn race turns the town into a festive carnival. The Hölderlin Tower commemorates the Romantic poet who lived here.\n\nA vibrant farmers' market fills the Marktplatz every Saturday morning. Philosopher Hegel once studied within these very streets. The colourful façades along the riverfront are a photographer's dream. The colourful façades along the riverfront are a photographer's dream. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The university dates back to the 15th century and shapes the town's rhythm. Tübingen sits picturesquely on the Neckar River. The university dates back to the 15th century and shapes the town's rhythm. The Hölderlin Tower commemorates the Romantic poet who lived here. The university dates back to the 15th century and shapes the town's rhythm."}
{"doc_id": "D018", "text": "Tübingen sits picturesquely on the Neckar River. The colourful façades along the riverfront are a photographer's dream. Locals and students alike enjoy punting boats called Stocherkähne. The observatory atop the castle hill hosts public stargazing nights. The Neckarinsel becomes a picnic hotspot as soon as spring arrives.\n\nThe observatory atop the castle hill hosts public stargazing nights. Locals and students alike enjoy punting boats called Stocherkähne. Philosopher Hegel once studied within these very streets. Cyclists weave through the old town, where cars are largely forbidden. The observatory atop the castle hill hosts public stargazing nights. Tübingen sits picturesquely on the Neckar River."}
{"doc_id": "D019", "text": "Cyclists weave through the old town, where cars are largely forbidden. Every June, the Stocherkahn race turns the town into a festive carnival. Locals and students alike enjoy punting boats called Stocherkähne. Winters are chilly but Christmas lights make the streets glow warmly. The Hölderlin Tower commemorates the Romantic poet who lived here. Winters are chilly but Christmas lights make the streets glow warmly. The colourful façades along the riverfront are a photographer's dream. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The colourful façades along the riverfront are a photographer's dream. The university dates back to the 15th century and shapes the town's rhythm.\n\nThe university dates back to the 15th century and shapes the town's rhythm. The university dates back to the 15th century and shapes the town's rhythm. A vibrant farmers' market fills the Marktplatz every Saturday morning. Cyclists weave through the old town, where cars are largely forbidden. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. A vibrant farmers' market fills the Marktplatz every Saturday morning."}
{"doc_id": "D020", "text": "Locals and students alike enjoy punting boats called Stocherkähne. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Philosopher Hegel once studied within these very streets. The observatory atop the castle hill hosts public stargazing nights. Autumn paints the surrounding Schönbuch forest in fiery reds. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Locals and students alike enjoy punting boats called Stocherkähne. Locals and students alike enjoy punting boats called Stocherkähne. Cyclists weave through the old town, where cars are largely forbidden.\n\nCafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Locals and students alike enjoy punting boats called Stocherkähne. A vibrant farmers' market fills the Marktplatz every Saturday morning. The university dates back to the 15th century and shapes the town's rhythm. Locals and students alike enjoy punting boats called Stocherkähne. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The town's mix of medieval timber‑frame houses and modern labs is striking. The town's mix of medieval timber‑frame houses and modern labs is striking. Cyclists weave through the old town, where cars are largely forbidden."}
{"doc_id": "D021", "text": "Locals and students alike enjoy punting boats called Stocherkähne. The Hölderlin Tower commemorates the Romantic poet who lived here. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. A vibrant farmers' market fills the Marktplatz every Saturday morning. The colourful façades along the riverfront are a photographer's dream.\n\nThe Neckarinsel becomes a picnic hotspot as soon as spring arrives. The observatory atop the castle hill hosts public stargazing nights. Every June, the Stocherkahn race turns the town into a festive carnival. Cyclists weave through the old town, where cars are largely forbidden. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The Hölderlin Tower commemorates the Romantic poet who lived here. Philosopher Hegel once studied within these very streets."}
{"doc_id": "D022", "text": "The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Winters are chilly but Christmas lights make the streets glow warmly. The colourful façades along the riverfront are a photographer's dream. Winters are chilly but Christmas lights make the streets glow warmly. The Hölderlin Tower commemorates the Romantic poet who lived here. Tübingen sits picturesquely on the Neckar River. Locals and students alike enjoy punting boats called Stocherkähne. Every June, the Stocherkahn race turns the town into a festive carnival. Every June, the Stocherkahn race turns the town into a festive carnival.\n\nEvery June, the Stocherkahn race turns the town into a festive carnival. The Hölderlin Tower commemorates the Romantic poet who lived here. A vibrant farmers' market fills the Marktplatz every Saturday morning. The town's mix of medieval timber‑frame houses and modern labs is striking. Cyclists weave through the old town, where cars are largely forbidden. A vibrant farmers' market fills the Marktplatz every Saturday morning. The town's mix of medieval timber‑frame houses and modern labs is striking."}
{"doc_id": "D023", "text": "Winters are chilly but Christmas lights make the streets glow warmly. Winters are chilly but Christmas lights make the streets glow warmly. The observatory atop the castle hill hosts public stargazing nights. The town's mix of medieval timber‑frame houses and modern labs is striking. Autumn paints the surrounding Schönbuch forest in fiery reds. Tübingen sits picturesquely on the Neckar River. Winters are chilly but Christmas lights make the streets glow warmly.\n\nThe observatory atop the castle hill hosts public stargazing nights. The university dates back to the 15th century and shapes the town's rhythm. Autumn paints the surrounding Schönbuch forest in fiery reds. The university dates back to the 15th century and shapes the town's rhythm. The colourful façades along the riverfront are a photographer's dream. The observatory atop the castle hill hosts public stargazing nights."}
{"doc_id": "D024", "text": "A vibrant farmers' market fills the Marktplatz every Saturday morning. Cyclists weave through the old town, where cars are largely forbidden. The observatory atop the castle hill hosts public stargazing nights. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Philosopher Hegel once studied within these very streets.\n\nThe town's mix of medieval timber‑frame houses and modern labs is striking. Winters are chilly but Christmas lights make the streets glow warmly. Tübingen sits picturesquely on the Neckar River. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Autumn paints the surrounding Schönbuch forest in fiery reds. Every June, the Stocherkahn race turns the town into a festive carnival. Autumn paints the surrounding Schönbuch forest in fiery reds."}
{"doc_id": "D025", "text": "The colourful façades along the riverfront are a photographer's dream. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Philosopher Hegel once studied within these very streets. Philosopher Hegel once studied within these very streets. Locals and students alike enjoy punting boats called Stocherkähne. Winters are chilly but Christmas lights make the streets glow warmly. The observatory atop the castle hill hosts public stargazing nights. The colourful façades along the riverfront are a photographer's dream. A vibrant farmers' market fills the Marktplatz every Saturday morning.\n\nThe Hölderlin Tower commemorates the Romantic poet who lived here. Philosopher Hegel once studied within these very streets. Locals and students alike enjoy punting boats called Stocherkähne. Philosopher Hegel once studied within these very streets. Locals and students alike enjoy punting boats called Stocherkähne. Autumn paints the surrounding Schönbuch forest in fiery reds. The Hölderlin Tower commemorates the Romantic poet who lived here."}
{"doc_id": "D026", "text": "Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Cyclists weave through the old town, where cars are largely forbidden. Every June, the Stocherkahn race turns the town into a festive carnival. Tübingen sits picturesquely on the Neckar River. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Autumn paints the surrounding Schönbuch forest in fiery reds. Autumn paints the surrounding Schönbuch forest in fiery reds. Tübingen sits picturesquely on the Neckar River. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee.\n\nCafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The colourful façades along the riverfront are a photographer's dream. Autumn paints the surrounding Schönbuch forest in fiery reds. Tübingen sits picturesquely on the Neckar River. The university dates back to the 15th century and shapes the town's rhythm. Autumn paints the surrounding Schönbuch forest in fiery reds. The observatory atop the castle hill hosts public stargazing nights. The university dates back to the 15th century and shapes the town's rhythm. The town's mix of medieval timber‑frame houses and modern labs is striking. Cyclists weave through the old town, where cars are largely forbidden."}
{"doc_id": "D027", "text": "Tübingen sits picturesquely on the Neckar River. The colourful façades along the riverfront are a photographer's dream. A vibrant farmers' market fills the Marktplatz every Saturday morning. Locals and students alike enjoy punting boats called Stocherkähne. Winters are chilly but Christmas lights make the streets glow warmly. Cyclists weave through the old town, where cars are largely forbidden. The university dates back to the 15th century and shapes the town's rhythm. The colourful façades along the riverfront are a photographer's dream.\n\nWinters are chilly but Christmas lights make the streets glow warmly. Philosopher Hegel once studied within these very streets. The colourful façades along the riverfront are a photographer's dream. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The observatory atop the castle hill hosts public stargazing nights. Philosopher Hegel once studied within these very streets."}
{"doc_id": "D028", "text": "Every June, the Stocherkahn race turns the town into a festive carnival. The town's mix of medieval timber‑frame houses and modern labs is striking. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Winters are chilly but Christmas lights make the streets glow warmly. Cyclists weave through the old town, where cars are largely forbidden. Tübingen sits picturesquely on the Neckar River. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Tübingen sits picturesquely on the Neckar River.\n\nThe town's mix of medieval timber‑frame houses and modern labs is striking. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Every June, the Stocherkahn race turns the town into a festive carnival. Locals and students alike enjoy punting boats called Stocherkähne. The colourful façades along the riverfront are a photographer's dream. Tübingen sits picturesquely on the Neckar River. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Autumn paints the surrounding Schönbuch forest in fiery reds."}
{"doc_id": "D029", "text": "Philosopher Hegel once studied within these very streets. Philosopher Hegel once studied within these very streets. Philosopher Hegel once studied within these very streets. Autumn paints the surrounding Schönbuch forest in fiery reds. The Hölderlin Tower commemorates the Romantic poet who lived here. Winters are chilly but Christmas lights make the streets glow warmly.\n\nWinters are chilly but Christmas lights make the streets glow warmly. The colourful façades along the riverfront are a photographer's dream. Winters are chilly but Christmas lights make the streets glow warmly. The Hölderlin Tower commemorates the Romantic poet who lived here. The colourful façades along the riverfront are a photographer's dream. Every June, the Stocherkahn race turns the town into a festive carnival. Autumn paints the surrounding Schönbuch forest in fiery reds. The observatory atop the castle hill hosts public stargazing nights. Cyclists weave through the old town, where cars are largely forbidden."}
{"doc_id": "D030", "text": "Tübingen sits picturesquely on the Neckar River. Philosopher Hegel once studied within these very streets. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The colourful façades along the riverfront are a photographer's dream. Cyclists weave through the old town, where cars are largely forbidden. Tübingen sits picturesquely on the Neckar River. A vibrant farmers' market fills the Marktplatz every Saturday morning. Cyclists weave through the old town, where cars are largely forbidden.\n\nThe Neckarinsel becomes a picnic hotspot as soon as spring arrives. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Locals and students alike enjoy punting boats called Stocherkähne. Every June, the Stocherkahn race turns the town into a festive carnival. Every June, the Stocherkahn race turns the town into a festive carnival. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The university dates back to the 15th century and shapes the town's rhythm. Locals and students alike enjoy punting boats called Stocherkähne. The observatory atop the castle hill hosts public stargazing nights. The Neckarinsel becomes a picnic hotspot as soon as spring arrives."}
{"doc_id": "D031", "text": "Cyclists weave through the old town, where cars are largely forbidden. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The colourful façades along the riverfront are a photographer's dream. The university dates back to the 15th century and shapes the town's rhythm. Tübingen sits picturesquely on the Neckar River. Tübingen sits picturesquely on the Neckar River. The observatory atop the castle hill hosts public stargazing nights. The Hölderlin Tower commemorates the Romantic poet who lived here.\n\nEvery June, the Stocherkahn race turns the town into a festive carnival. A vibrant farmers' market fills the Marktplatz every Saturday morning. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The town's mix of medieval timber‑frame houses and modern labs is striking. The university dates back to the 15th century and shapes the town's rhythm. A vibrant farmers' market fills the Marktplatz every Saturday morning. Philosopher Hegel once studied within these very streets. The observatory atop the castle hill hosts public stargazing nights."}
{"doc_id": "D032", "text": "The town's mix of medieval timber‑frame houses and modern labs is striking. The colourful façades along the riverfront are a photographer's dream. Winters are chilly but Christmas lights make the streets glow warmly. The Hölderlin Tower commemorates the Romantic poet who lived here. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. A vibrant farmers' market fills the Marktplatz every Saturday morning. Every June, the Stocherkahn race turns the town into a festive carnival. The town's mix of medieval timber‑frame houses and modern labs is striking.\n\nEvery June, the Stocherkahn race turns the town into a festive carnival. Every June, the Stocherkahn race turns the town into a festive carnival. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Philosopher Hegel once studied within these very streets. Autumn paints the surrounding Schönbuch forest in fiery reds. A vibrant farmers' market fills the Marktplatz every Saturday morning."}
{"doc_id": "D033", "text": "The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Autumn paints the surrounding Schönbuch forest in fiery reds. Autumn paints the surrounding Schönbuch forest in fiery reds. The town's mix of medieval timber‑frame houses and modern labs is striking. A vibrant farmers' market fills the Marktplatz every Saturday morning.\n\nA vibrant farmers' market fills the Marktplatz every Saturday morning. The colourful façades along the riverfront are a photographer's dream. The university dates back to the 15th century and shapes the town's rhythm. Philosopher Hegel once studied within these very streets. Tübingen sits picturesquely on the Neckar River. Cyclists weave through the old town, where cars are largely forbidden."}
{"doc_id": "D034", "text": "Cyclists weave through the old town, where cars are largely forbidden. Winters are chilly but Christmas lights make the streets glow warmly. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Cyclists weave through the old town, where cars are largely forbidden. The university dates back to the 15th century and shapes the town's rhythm. Philosopher Hegel once studied within these very streets.\n\nPhilosopher Hegel once studied within these very streets. Locals and students alike enjoy punting boats called Stocherkähne. Every June, the Stocherkahn race turns the town into a festive carnival. Locals and students alike enjoy punting boats called Stocherkähne. The town's mix of medieval timber‑frame houses and modern labs is striking. Autumn paints the surrounding Schönbuch forest in fiery reds. The university dates back to the 15th century and shapes the town's rhythm. The town's mix of medieval timber‑frame houses and modern labs is striking. Locals and students alike enjoy punting boats called Stocherkähne. Tübingen sits picturesquely on the Neckar River."}
{"doc_id": "D035", "text": "The Hölderlin Tower commemorates the Romantic poet who lived here. The observatory atop the castle hill hosts public stargazing nights. Philosopher Hegel once studied within these very streets. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The observatory atop the castle hill hosts public stargazing nights. Autumn paints the surrounding Schönbuch forest in fiery reds. A vibrant farmers' market fills the Marktplatz every Saturday morning.\n\nThe observatory atop the castle hill hosts public stargazing nights. The university dates back to the 15th century and shapes the town's rhythm. Cyclists weave through the old town, where cars are largely forbidden. The Hölderlin Tower commemorates the Romantic poet who lived here. Cyclists weave through the old town, where cars are largely forbidden. The Hölderlin Tower commemorates the Romantic poet who lived here. Philosopher Hegel once studied within these very streets. Cyclists weave through the old town, where cars are largely forbidden. Tübingen sits picturesquely on the Neckar River."}
{"doc_id": "D036", "text": "The university dates back to the 15th century and shapes the town's rhythm. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The observatory atop the castle hill hosts public stargazing nights. Autumn paints the surrounding Schönbuch forest in fiery reds. Winters are chilly but Christmas lights make the streets glow warmly. The Neckarinsel becomes a picnic hotspot as soon as spring arrives.\n\nThe Hölderlin Tower commemorates the Romantic poet who lived here. Cyclists weave through the old town, where cars are largely forbidden. Every June, the Stocherkahn race turns the town into a festive carnival. Winters are chilly but Christmas lights make the streets glow warmly. Locals and students alike enjoy punting boats called Stocherkähne. The Neckarinsel becomes a picnic hotspot as soon as spring arrives."}
{"doc_id": "D037", "text": "Autumn paints the surrounding Schönbuch forest in fiery reds. The colourful façades along the riverfront are a photographer's dream. Locals and students alike enjoy punting boats called Stocherkähne. The observatory atop the castle hill hosts public stargazing nights. Tübingen sits picturesquely on the Neckar River. The Hölderlin Tower commemorates the Romantic poet who lived here. A vibrant farmers' market fills the Marktplatz every Saturday morning. The observatory atop the castle hill hosts public stargazing nights. The Hölderlin Tower commemorates the Romantic poet who lived here. The Hölderlin Tower commemorates the Romantic poet who lived here.\n\nThe university dates back to the 15th century and shapes the town's rhythm. The Hölderlin Tower commemorates the Romantic poet who lived here. Autumn paints the surrounding Schönbuch forest in fiery reds. The town's mix of medieval timber‑frame houses and modern labs is striking. A vibrant farmers' market fills the Marktplatz every Saturday morning. The Hölderlin Tower commemorates the Romantic poet who lived here. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Locals and students alike enjoy punting boats called Stocherkähne."}
{"doc_id": "D038", "text": "Tübingen sits picturesquely on the Neckar River. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Philosopher Hegel once studied within these very streets. Locals and students alike enjoy punting boats called Stocherkähne. Autumn paints the surrounding Schönbuch forest in fiery reds.\n\nCyclists weave through the old town, where cars are largely forbidden. Philosopher Hegel once studied within these very streets. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The university dates back to the 15th century and shapes the town's rhythm. A vibrant farmers' market fills the Marktplatz every Saturday morning. Locals and students alike enjoy punting boats called Stocherkähne. The university dates back to the 15th century and shapes the town's rhythm. Locals and students alike enjoy punting boats called Stocherkähne."}
{"doc_id": "D039", "text": "The Hölderlin Tower commemorates the Romantic poet who lived here. The observatory atop the castle hill hosts public stargazing nights. Cyclists weave through the old town, where cars are largely forbidden. A vibrant farmers' market fills the Marktplatz every Saturday morning. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The Hölderlin Tower commemorates the Romantic poet who lived here. Cyclists weave through the old town, where cars are largely forbidden. Philosopher Hegel once studied within these very streets.\n\nThe Neckarinsel becomes a picnic hotspot as soon as spring arrives. Tübingen sits picturesquely on the Neckar River. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. A vibrant farmers' market fills the Marktplatz every Saturday morning. The university dates back to the 15th century and shapes the town's rhythm. A vibrant farmers' market fills the Marktplatz every Saturday morning."}
{"doc_id": "D040", "text": "Cyclists weave through the old town, where cars are largely forbidden. The town's mix of medieval timber‑frame houses and modern labs is striking. Cyclists weave through the old town, where cars are largely forbidden. Autumn paints the surrounding Schönbuch forest in fiery reds. Philosopher Hegel once studied within these very streets.\n\nThe university dates back to the 15th century and shapes the town's rhythm. Cyclists weave through the old town, where cars are largely forbidden. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The colourful façades along the riverfront are a photographer's dream. The university dates back to the 15th century and shapes the town's rhythm. The Hölderlin Tower commemorates the Romantic poet who lived here. Winters are chilly but Christmas lights make the streets glow warmly."}
{"doc_id": "D041", "text": "The town's mix of medieval timber‑frame houses and modern labs is striking. The colourful façades along the riverfront are a photographer's dream. The town's mix of medieval timber‑frame houses and modern labs is striking. A vibrant farmers' market fills the Marktplatz every Saturday morning. A vibrant farmers' market fills the Marktplatz every Saturday morning. The colourful façades along the riverfront are a photographer's dream. Every June, the Stocherkahn race turns the town into a festive carnival. Cyclists weave through the old town, where cars are largely forbidden. The Hölderlin Tower commemorates the Romantic poet who lived here. The observatory atop the castle hill hosts public stargazing nights.\n\nCafés spill onto cobblestone alleys offering Swabian pretzels and coffee. A vibrant farmers' market fills the Marktplatz every Saturday morning. The observatory atop the castle hill hosts public stargazing nights. The university dates back to the 15th century and shapes the town's rhythm. The colourful façades along the riverfront are a photographer's dream. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Tübingen sits picturesquely on the Neckar River. Every June, the Stocherkahn race turns the town into a festive carnival. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee."}
{"doc_id": "D042", "text": "The observatory atop the castle hill hosts public stargazing nights. The university dates back to the 15th century and shapes the town's rhythm. Winters are chilly but Christmas lights make the streets glow warmly. The Hölderlin Tower commemorates the Romantic poet who lived here. A vibrant farmers' market fills the Marktplatz every Saturday morning.\n\nLocals and students alike enjoy punting boats called Stocherkähne. Philosopher Hegel once studied within these very streets. The colourful façades along the riverfront are a photographer's dream. The observatory atop the castle hill hosts public stargazing nights. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. A vibrant farmers' market fills the Marktplatz every Saturday morning. Winters are chilly but Christmas lights make the streets glow warmly. The university dates back to the 15th century and shapes the town's rhythm."}
{"doc_id": "D043", "text": "The town's mix of medieval timber‑frame houses and modern labs is striking. Cyclists weave through the old town, where cars are largely forbidden. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Tübingen sits picturesquely on the Neckar River. Every June, the Stocherkahn race turns the town into a festive carnival. Philosopher Hegel once studied within these very streets. The university dates back to the 15th century and shapes the town's rhythm. The town's mix of medieval timber‑frame houses and modern labs is striking. The Neckarinsel becomes a picnic hotspot as soon as spring arrives.\n\nCafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Locals and students alike enjoy punting boats called Stocherkähne. Philosopher Hegel once studied within these very streets. Locals and students alike enjoy punting boats called Stocherkähne. The colourful façades along the riverfront are a photographer's dream. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The university dates back to the 15th century and shapes the town's rhythm. The university dates back to the 15th century and shapes the town's rhythm. The observatory atop the castle hill hosts public stargazing nights."}
{"doc_id": "D044", "text": "The observatory atop the castle hill hosts public stargazing nights. Every June, the Stocherkahn race turns the town into a festive carnival. Every June, the Stocherkahn race turns the town into a festive carnival. Cyclists weave through the old town, where cars are largely forbidden. Cyclists weave through the old town, where cars are largely forbidden. The observatory atop the castle hill hosts public stargazing nights. The university dates back to the 15th century and shapes the town's rhythm.\n\nPhilosopher Hegel once studied within these very streets. Tübingen sits picturesquely on the Neckar River. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The colourful façades along the riverfront are a photographer's dream. The Hölderlin Tower commemorates the Romantic poet who lived here. The Hölderlin Tower commemorates the Romantic poet who lived here. A vibrant farmers' market fills the Marktplatz every Saturday morning. Locals and students alike enjoy punting boats called Stocherkähne. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee."}
{"doc_id": "D045", "text": "Cyclists weave through the old town, where cars are largely forbidden. The Hölderlin Tower commemorates the Romantic poet who lived here. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The Hölderlin Tower commemorates the Romantic poet who lived here. Every June, the Stocherkahn race turns the town into a festive carnival. Every June, the Stocherkahn race turns the town into a festive carnival. Cyclists weave through the old town, where cars are largely forbidden. The town's mix of medieval timber‑frame houses and modern labs is striking. The Hölderlin Tower commemorates the Romantic poet who lived here.\n\nA vibrant farmers' market fills the Marktplatz every Saturday morning. The university dates back to the 15th century and shapes the town's rhythm. Cyclists weave through the old town, where cars are largely forbidden. The Hölderlin Tower commemorates the Romantic poet who lived here. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The town's mix of medieval timber‑frame houses and modern labs is striking. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The university dates back to the 15th century and shapes the town's rhythm."}
{"doc_id": "D046", "text": "Every June, the Stocherkahn race turns the town into a festive carnival. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The observatory atop the castle hill hosts public stargazing nights. The town's mix of medieval timber‑frame houses and modern labs is striking. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Winters are chilly but Christmas lights make the streets glow warmly.\n\nEvery June, the Stocherkahn race turns the town into a festive carnival. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The colourful façades along the riverfront are a photographer's dream. The university dates back to the 15th century and shapes the town's rhythm. Every June, the Stocherkahn race turns the town into a festive carnival."}
{"doc_id": "D047", "text": "Locals and students alike enjoy punting boats called Stocherkähne. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The Hölderlin Tower commemorates the Romantic poet who lived here. A vibrant farmers' market fills the Marktplatz every Saturday morning. The Hölderlin Tower commemorates the Romantic poet who lived here. Every June, the Stocherkahn race turns the town into a festive carnival. The colourful façades along the riverfront are a photographer's dream. The colourful façades along the riverfront are a photographer's dream.\n\nThe town's mix of medieval timber‑frame houses and modern labs is striking. Tübingen sits picturesquely on the Neckar River. Autumn paints the surrounding Schönbuch forest in fiery reds. Every June, the Stocherkahn race turns the town into a festive carnival. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The Neckarinsel becomes a picnic hotspot as soon as spring arrives."}
{"doc_id": "D048", "text": "The observatory atop the castle hill hosts public stargazing nights. Tübingen sits picturesquely on the Neckar River. Cyclists weave through the old town, where cars are largely forbidden. The colourful façades along the riverfront are a photographer's dream. Tübingen sits picturesquely on the Neckar River.\n\nThe town's mix of medieval timber‑frame houses and modern labs is striking. The town's mix of medieval timber‑frame houses and modern labs is striking. The observatory atop the castle hill hosts public stargazing nights. Every June, the Stocherkahn race turns the town into a festive carnival. The town's mix of medieval timber‑frame houses and modern labs is striking. The Hölderlin Tower commemorates the Romantic poet who lived here. Locals and students alike enjoy punting boats called Stocherkähne. Locals and students alike enjoy punting boats called Stocherkähne."}
{"doc_id": "D049", "text": "Every June, the Stocherkahn race turns the town into a festive carnival. Cyclists weave through the old town, where cars are largely forbidden. The observatory atop the castle hill hosts public stargazing nights. Every June, the Stocherkahn race turns the town into a festive carnival. The colourful façades along the riverfront are a photographer's dream. A vibrant farmers' market fills the Marktplatz every Saturday morning. The Hölderlin Tower commemorates the Romantic poet who lived here. The Neckarinsel becomes a picnic hotspot as soon as spring arrives.\n\nThe observatory atop the castle hill hosts public stargazing nights. A vibrant farmers' market fills the Marktplatz every Saturday morning. Autumn paints the surrounding Schönbuch forest in fiery reds. Philosopher Hegel once studied within these very streets. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee."}
{"doc_id": "D050", "text": "Every June, the Stocherkahn race turns the town into a festive carnival. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The colourful façades along the riverfront are a photographer's dream. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The colourful façades along the riverfront are a photographer's dream. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. A vibrant farmers' market fills the Marktplatz every Saturday morning. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. A vibrant farmers' market fills the Marktplatz every Saturday morning. Tübingen sits picturesquely on the Neckar River.\n\nCafés spill onto cobblestone alleys offering Swabian pretzels and coffee. A vibrant farmers' market fills the Marktplatz every Saturday morning. Tübingen sits picturesquely on the Neckar River. Every June, the Stocherkahn race turns the town into a festive carnival. Locals and students alike enjoy punting boats called Stocherkähne. The Hölderlin Tower commemorates the Romantic poet who lived here. A vibrant farmers' market fills the Marktplatz every Saturday morning."}
{"doc_id": "D051", "text": "Autumn paints the surrounding Schönbuch forest in fiery reds. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Philosopher Hegel once studied within these very streets. A vibrant farmers' market fills the Marktplatz every Saturday morning. The university dates back to the 15th century and shapes the town's rhythm.\n\nCyclists weave through the old town, where cars are largely forbidden. Autumn paints the surrounding Schönbuch forest in fiery reds. Winters are chilly but Christmas lights make the streets glow warmly. Autumn paints the surrounding Schönbuch forest in fiery reds. The university dates back to the 15th century and shapes the town's rhythm. A vibrant farmers' market fills the Marktplatz every Saturday morning. Philosopher Hegel once studied within these very streets."}
{"doc_id": "D052", "text": "Philosopher Hegel once studied within these very streets. Cyclists weave through the old town, where cars are largely forbidden. Autumn paints the surrounding Schönbuch forest in fiery reds. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The university dates back to the 15th century and shapes the town's rhythm. Cyclists weave through the old town, where cars are largely forbidden. Tübingen sits picturesquely on the Neckar River. A vibrant farmers' market fills the Marktplatz every Saturday morning. The observatory atop the castle hill hosts public stargazing nights.\n\nAutumn paints the surrounding Schönbuch forest in fiery reds. The university dates back to the 15th century and shapes the town's rhythm. Autumn paints the surrounding Schönbuch forest in fiery reds. Cyclists weave through the old town, where cars are largely forbidden. Every June, the Stocherkahn race turns the town into a festive carnival. The Hölderlin Tower commemorates the Romantic poet who lived here. Tübingen sits picturesquely on the Neckar River. Autumn paints the surrounding Schönbuch forest in fiery reds. The university dates back to the 15th century and shapes the town's rhythm. The Hölderlin Tower commemorates the Romantic poet who lived here."}
{"doc_id": "D053", "text": "Autumn paints the surrounding Schönbuch forest in fiery reds. The observatory atop the castle hill hosts public stargazing nights. The town's mix of medieval timber‑frame houses and modern labs is striking. The town's mix of medieval timber‑frame houses and modern labs is striking. The Hölderlin Tower commemorates the Romantic poet who lived here.\n\nThe Hölderlin Tower commemorates the Romantic poet who lived here. Cyclists weave through the old town, where cars are largely forbidden. Cyclists weave through the old town, where cars are largely forbidden. Autumn paints the surrounding Schönbuch forest in fiery reds. Every June, the Stocherkahn race turns the town into a festive carnival."}
{"doc_id": "D054", "text": "Winters are chilly but Christmas lights make the streets glow warmly. Winters are chilly but Christmas lights make the streets glow warmly. Winters are chilly but Christmas lights make the streets glow warmly. The observatory atop the castle hill hosts public stargazing nights. The university dates back to the 15th century and shapes the town's rhythm. The town's mix of medieval timber‑frame houses and modern labs is striking. Philosopher Hegel once studied within these very streets. The university dates back to the 15th century and shapes the town's rhythm. Every June, the Stocherkahn race turns the town into a festive carnival. Locals and students alike enjoy punting boats called Stocherkähne.\n\nA vibrant farmers' market fills the Marktplatz every Saturday morning. The university dates back to the 15th century and shapes the town's rhythm. Every June, the Stocherkahn race turns the town into a festive carnival. Locals and students alike enjoy punting boats called Stocherkähne. Locals and students alike enjoy punting boats called Stocherkähne."}
{"doc_id": "D055", "text": "The university dates back to the 15th century and shapes the town's rhythm. The town's mix of medieval timber‑frame houses and modern labs is striking. The observatory atop the castle hill hosts public stargazing nights. A vibrant farmers' market fills the Marktplatz every Saturday morning. A vibrant farmers' market fills the Marktplatz every Saturday morning. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. A vibrant farmers' market fills the Marktplatz every Saturday morning.\n\nAutumn paints the surrounding Schönbuch forest in fiery reds. The observatory atop the castle hill hosts public stargazing nights. The town's mix of medieval timber‑frame houses and modern labs is striking. Cyclists weave through the old town, where cars are largely forbidden. The town's mix of medieval timber‑frame houses and modern labs is striking. Autumn paints the surrounding Schönbuch forest in fiery reds. Every June, the Stocherkahn race turns the town into a festive carnival."}
{"doc_id": "D056", "text": "The university dates back to the 15th century and shapes the town's rhythm. A vibrant farmers' market fills the Marktplatz every Saturday morning. Every June, the Stocherkahn race turns the town into a festive carnival. Philosopher Hegel once studied within these very streets. The observatory atop the castle hill hosts public stargazing nights. Every June, the Stocherkahn race turns the town into a festive carnival. Philosopher Hegel once studied within these very streets. Winters are chilly but Christmas lights make the streets glow warmly.\n\nWinters are chilly but Christmas lights make the streets glow warmly. Tübingen sits picturesquely on the Neckar River. The observatory atop the castle hill hosts public stargazing nights. Philosopher Hegel once studied within these very streets. The Hölderlin Tower commemorates the Romantic poet who lived here. The Hölderlin Tower commemorates the Romantic poet who lived here."}
{"doc_id": "D057", "text": "The town's mix of medieval timber‑frame houses and modern labs is striking. Cyclists weave through the old town, where cars are largely forbidden. Every June, the Stocherkahn race turns the town into a festive carnival. The Hölderlin Tower commemorates the Romantic poet who lived here. Tübingen sits picturesquely on the Neckar River. The Hölderlin Tower commemorates the Romantic poet who lived here. The colourful façades along the riverfront are a photographer's dream. The colourful façades along the riverfront are a photographer's dream. Philosopher Hegel once studied within these very streets. The university dates back to the 15th century and shapes the town's rhythm.\n\nThe town's mix of medieval timber‑frame houses and modern labs is striking. The observatory atop the castle hill hosts public stargazing nights. Locals and students alike enjoy punting boats called Stocherkähne. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Philosopher Hegel once studied within these very streets. Tübingen sits picturesquely on the Neckar River. Every June, the Stocherkahn race turns the town into a festive carnival."}
{"doc_id": "D058", "text": "Cyclists weave through the old town, where cars are largely forbidden. Autumn paints the surrounding Schönbuch forest in fiery reds. The colourful façades along the riverfront are a photographer's dream. Cyclists weave through the old town, where cars are largely forbidden. Cyclists weave through the old town, where cars are largely forbidden. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The Neckarinsel becomes a picnic hotspot as soon as spring arrives.\n\nWinters are chilly but Christmas lights make the streets glow warmly. Autumn paints the surrounding Schönbuch forest in fiery reds. The observatory atop the castle hill hosts public stargazing nights. Locals and students alike enjoy punting boats called Stocherkähne. The colourful façades along the riverfront are a photographer's dream. The town's mix of medieval timber‑frame houses and modern labs is striking. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The colourful façades along the riverfront are a photographer's dream."}
{"doc_id": "D059", "text": "Every June, the Stocherkahn race turns the town into a festive carnival. Philosopher Hegel once studied within these very streets. The town's mix of medieval timber‑frame houses and modern labs is striking. Cyclists weave through the old town, where cars are largely forbidden. Cyclists weave through the old town, where cars are largely forbidden.\n\nWinters are chilly but Christmas lights make the streets glow warmly. The university dates back to the 15th century and shapes the town's rhythm. Tübingen sits picturesquely on the Neckar River. Autumn paints the surrounding Schönbuch forest in fiery reds. A vibrant farmers' market fills the Marktplatz every Saturday morning. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Winters are chilly but Christmas lights make the streets glow warmly. The town's mix of medieval timber‑frame houses and modern labs is striking. The Hölderlin Tower commemorates the Romantic poet who lived here."}
{"doc_id": "D060", "text": "The town's mix of medieval timber‑frame houses and modern labs is striking. Every June, the Stocherkahn race turns the town into a festive carnival. The university dates back to the 15th century and shapes the town's rhythm. Tübingen sits picturesquely on the Neckar River. The observatory atop the castle hill hosts public stargazing nights. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The observatory atop the castle hill hosts public stargazing nights. The observatory atop the castle hill hosts public stargazing nights. Autumn paints the surrounding Schönbuch forest in fiery reds.\n\nTübingen sits picturesquely on the Neckar River. Philosopher Hegel once studied within these very streets. Locals and students alike enjoy punting boats called Stocherkähne. The observatory atop the castle hill hosts public stargazing nights. Winters are chilly but Christmas lights make the streets glow warmly. Autumn paints the surrounding Schönbuch forest in fiery reds. The town's mix of medieval timber‑frame houses and modern labs is striking. Tübingen sits picturesquely on the Neckar River."}
{"doc_id": "D061", "text": "The colourful façades along the riverfront are a photographer's dream. Winters are chilly but Christmas lights make the streets glow warmly. Cyclists weave through the old town, where cars are largely forbidden. A vibrant farmers' market fills the Marktplatz every Saturday morning. Every June, the Stocherkahn race turns the town into a festive carnival. The colourful façades along the riverfront are a photographer's dream. Cyclists weave through the old town, where cars are largely forbidden.\n\nA vibrant farmers' market fills the Marktplatz every Saturday morning. Autumn paints the surrounding Schönbuch forest in fiery reds. Locals and students alike enjoy punting boats called Stocherkähne. Locals and students alike enjoy punting boats called Stocherkähne. A vibrant farmers' market fills the Marktplatz every Saturday morning. The Hölderlin Tower commemorates the Romantic poet who lived here. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Every June, the Stocherkahn race turns the town into a festive carnival. Locals and students alike enjoy punting boats called Stocherkähne. Tübingen sits picturesquely on the Neckar River."}
{"doc_id": "D062", "text": "A vibrant farmers' market fills the Marktplatz every Saturday morning. The Hölderlin Tower commemorates the Romantic poet who lived here. The colourful façades along the riverfront are a photographer's dream. The town's mix of medieval timber‑frame houses and modern labs is striking. Every June, the Stocherkahn race turns the town into a festive carnival. Tübingen sits picturesquely on the Neckar River. Every June, the Stocherkahn race turns the town into a festive carnival.\n\nThe university dates back to the 15th century and shapes the town's rhythm. Autumn paints the surrounding Schönbuch forest in fiery reds. Every June, the Stocherkahn race turns the town into a festive carnival. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The university dates back to the 15th century and shapes the town's rhythm. The colourful façades along the riverfront are a photographer's dream."}
{"doc_id": "D063", "text": "The observatory atop the castle hill hosts public stargazing nights. The colourful façades along the riverfront are a photographer's dream. The university dates back to the 15th century and shapes the town's rhythm. Philosopher Hegel once studied within these very streets. Philosopher Hegel once studied within these very streets. The Hölderlin Tower commemorates the Romantic poet who lived here. The colourful façades along the riverfront are a photographer's dream. Cyclists weave through the old town, where cars are largely forbidden. The colourful façades along the riverfront are a photographer's dream. Locals and students alike enjoy punting boats called Stocherkähne.\n\nWinters are chilly but Christmas lights make the streets glow warmly. A vibrant farmers' market fills the Marktplatz every Saturday morning. Winters are chilly but Christmas lights make the streets glow warmly. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Cyclists weave through the old town, where cars are largely forbidden. The colourful façades along the riverfront are a photographer's dream. Every June, the Stocherkahn race turns the town into a festive carnival. The Neckarinsel becomes a picnic hotspot as soon as spring arrives."}
{"doc_id": "D064", "text": "Locals and students alike enjoy punting boats called Stocherkähne. The Hölderlin Tower commemorates the Romantic poet who lived here. The town's mix of medieval timber‑frame houses and modern labs is striking. Winters are chilly but Christmas lights make the streets glow warmly. The colourful façades along the riverfront are a photographer's dream.\n\nThe town's mix of medieval timber‑frame houses and modern labs is striking. The Hölderlin Tower commemorates the Romantic poet who lived here. Every June, the Stocherkahn race turns the town into a festive carnival. Philosopher Hegel once studied within these very streets. Every June, the Stocherkahn race turns the town into a festive carnival. Autumn paints the surrounding Schönbuch forest in fiery reds. Winters are chilly but Christmas lights make the streets glow warmly. Philosopher Hegel once studied within these very streets. Cyclists weave through the old town, where cars are largely forbidden."}
{"doc_id": "D065", "text": "The Hölderlin Tower commemorates the Romantic poet who lived here. Philosopher Hegel once studied within these very streets. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Locals and students alike enjoy punting boats called Stocherkähne. Locals and students alike enjoy punting boats called Stocherkähne.\n\nThe town's mix of medieval timber‑frame houses and modern labs is striking. The Hölderlin Tower commemorates the Romantic poet who lived here. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The town's mix of medieval timber‑frame houses and modern labs is striking. Winters are chilly but Christmas lights make the streets glow warmly. Philosopher Hegel once studied within these very streets. The observatory atop the castle hill hosts public stargazing nights. Every June, the Stocherkahn race turns the town into a festive carnival. The observatory atop the castle hill hosts public stargazing nights."}
{"doc_id": "D066", "text": "Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The colourful façades along the riverfront are a photographer's dream. The town's mix of medieval timber‑frame houses and modern labs is striking. A vibrant farmers' market fills the Marktplatz every Saturday morning. Tübingen sits picturesquely on the Neckar River. The university dates back to the 15th century and shapes the town's rhythm. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee.\n\nPhilosopher Hegel once studied within these very streets. Autumn paints the surrounding Schönbuch forest in fiery reds. Autumn paints the surrounding Schönbuch forest in fiery reds. Winters are chilly but Christmas lights make the streets glow warmly. The town's mix of medieval timber‑frame houses and modern labs is striking. Autumn paints the surrounding Schönbuch forest in fiery reds. Cyclists weave through the old town, where cars are largely forbidden. Autumn paints the surrounding Schönbuch forest in fiery reds. Every June, the Stocherkahn race turns the town into a festive carnival. The Neckarinsel becomes a picnic hotspot as soon as spring arrives."}
{"doc_id": "D067", "text": "Cyclists weave through the old town, where cars are largely forbidden. Cyclists weave through the old town, where cars are largely forbidden. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The colourful façades along the riverfront are a photographer's dream. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The colourful façades along the riverfront are a photographer's dream. Every June, the Stocherkahn race turns the town into a festive carnival.\n\nThe university dates back to the 15th century and shapes the town's rhythm. Locals and students alike enjoy punting boats called Stocherkähne. Locals and students alike enjoy punting boats called Stocherkähne. Every June, the Stocherkahn race turns the town into a festive carnival. A vibrant farmers' market fills the Marktplatz every Saturday morning. Winters are chilly but Christmas lights make the streets glow warmly. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. A vibrant farmers' market fills the Marktplatz every Saturday morning."}
{"doc_id": "D068", "text": "Tübingen sits picturesquely on the Neckar River. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Cyclists weave through the old town, where cars are largely forbidden. The university dates back to the 15th century and shapes the town's rhythm. The Hölderlin Tower commemorates the Romantic poet who lived here. The university dates back to the 15th century and shapes the town's rhythm.\n\nThe colourful façades along the riverfront are a photographer's dream. A vibrant farmers' market fills the Marktplatz every Saturday morning. Every June, the Stocherkahn race turns the town into a festive carnival. A vibrant farmers' market fills the Marktplatz every Saturday morning. A vibrant farmers' market fills the Marktplatz every Saturday morning. The university dates back to the 15th century and shapes the town's rhythm. Locals and students alike enjoy punting boats called Stocherkähne. Cyclists weave through the old town, where cars are largely forbidden."}
{"doc_id": "D069", "text": "The Hölderlin Tower commemorates the Romantic poet who lived here. The colourful façades along the riverfront are a photographer's dream. Autumn paints the surrounding Schönbuch forest in fiery reds. Tübingen sits picturesquely on the Neckar River. Locals and students alike enjoy punting boats called Stocherkähne. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The observatory atop the castle hill hosts public stargazing nights.\n\nWinters are chilly but Christmas lights make the streets glow warmly. The observatory atop the castle hill hosts public stargazing nights. Every June, the Stocherkahn race turns the town into a festive carnival. Autumn paints the surrounding Schönbuch forest in fiery reds. A vibrant farmers' market fills the Marktplatz every Saturday morning. Locals and students alike enjoy punting boats called Stocherkähne. The Hölderlin Tower commemorates the Romantic poet who lived here."}
{"doc_id": "D070", "text": "Locals and students alike enjoy punting boats called Stocherkähne. A vibrant farmers' market fills the Marktplatz every Saturday morning. Winters are chilly but Christmas lights make the streets glow warmly. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Every June, the Stocherkahn race turns the town into a festive carnival.\n\nWinters are chilly but Christmas lights make the streets glow warmly. The Hölderlin Tower commemorates the Romantic poet who lived here. Locals and students alike enjoy punting boats called Stocherkähne. A vibrant farmers' market fills the Marktplatz every Saturday morning. The university dates back to the 15th century and shapes the town's rhythm. Philosopher Hegel once studied within these very streets. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Tübingen sits picturesquely on the Neckar River."}
{"doc_id": "D071", "text": "The colourful façades along the riverfront are a photographer's dream. Philosopher Hegel once studied within these very streets. Tübingen sits picturesquely on the Neckar River. Winters are chilly but Christmas lights make the streets glow warmly. A vibrant farmers' market fills the Marktplatz every Saturday morning. The town's mix of medieval timber‑frame houses and modern labs is striking. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee.\n\nThe observatory atop the castle hill hosts public stargazing nights. Every June, the Stocherkahn race turns the town into a festive carnival. The university dates back to the 15th century and shapes the town's rhythm. The town's mix of medieval timber‑frame houses and modern labs is striking. The Hölderlin Tower commemorates the Romantic poet who lived here."}
{"doc_id": "D072", "text": "Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Winters are chilly but Christmas lights make the streets glow warmly. Every June, the Stocherkahn race turns the town into a festive carnival. The town's mix of medieval timber‑frame houses and modern labs is striking. A vibrant farmers' market fills the Marktplatz every Saturday morning.\n\nLocals and students alike enjoy punting boats called Stocherkähne. Philosopher Hegel once studied within these very streets. The observatory atop the castle hill hosts public stargazing nights. Tübingen sits picturesquely on the Neckar River. The colourful façades along the riverfront are a photographer's dream. The colourful façades along the riverfront are a photographer's dream. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The colourful façades along the riverfront are a photographer's dream. Tübingen sits picturesquely on the Neckar River."}
{"doc_id": "D073", "text": "Philosopher Hegel once studied within these very streets. Tübingen sits picturesquely on the Neckar River. Winters are chilly but Christmas lights make the streets glow warmly. Autumn paints the surrounding Schönbuch forest in fiery reds. The colourful façades along the riverfront are a photographer's dream. The town's mix of medieval timber‑frame houses and modern labs is striking. The town's mix of medieval timber‑frame houses and modern labs is striking.\n\nCyclists weave through the old town, where cars are largely forbidden. The town's mix of medieval timber‑frame houses and modern labs is striking. Locals and students alike enjoy punting boats called Stocherkähne. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. A vibrant farmers' market fills the Marktplatz every Saturday morning. A vibrant farmers' market fills the Marktplatz every Saturday morning. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Every June, the Stocherkahn race turns the town into a festive carnival."}
{"doc_id": "D074", "text": "Tübingen sits picturesquely on the Neckar River. The university dates back to the 15th century and shapes the town's rhythm. Philosopher Hegel once studied within these very streets. Philosopher Hegel once studied within these very streets. Winters are chilly but Christmas lights make the streets glow warmly. Philosopher Hegel once studied within these very streets. Tübingen sits picturesquely on the Neckar River. The university dates back to the 15th century and shapes the town's rhythm.\n\nCafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Cyclists weave through the old town, where cars are largely forbidden. The Hölderlin Tower commemorates the Romantic poet who lived here. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The university dates back to the 15th century and shapes the town's rhythm. The town's mix of medieval timber‑frame houses and modern labs is striking. Cyclists weave through the old town, where cars are largely forbidden. The observatory atop the castle hill hosts public stargazing nights."}
{"doc_id": "D075", "text": "Every June, the Stocherkahn race turns the town into a festive carnival. Cyclists weave through the old town, where cars are largely forbidden. Every June, the Stocherkahn race turns the town into a festive carnival. The town's mix of medieval timber‑frame houses and modern labs is striking. The university dates back to the 15th century and shapes the town's rhythm. Locals and students alike enjoy punting boats called Stocherkähne. A vibrant farmers' market fills the Marktplatz every Saturday morning. The university dates back to the 15th century and shapes the town's rhythm. The town's mix of medieval timber‑frame houses and modern labs is striking. The colourful façades along the riverfront are a photographer's dream.\n\nTübingen sits picturesquely on the Neckar River. Locals and students alike enjoy punting boats called Stocherkähne. The town's mix of medieval timber‑frame houses and modern labs is striking. Every June, the Stocherkahn race turns the town into a festive carnival. Philosopher Hegel once studied within these very streets. A vibrant farmers' market fills the Marktplatz every Saturday morning. Winters are chilly but Christmas lights make the streets glow warmly. The university dates back to the 15th century and shapes the town's rhythm."}
{"doc_id": "D076", "text": "Winters are chilly but Christmas lights make the streets glow warmly. A vibrant farmers' market fills the Marktplatz every Saturday morning. Tübingen sits picturesquely on the Neckar River. Philosopher Hegel once studied within these very streets. Every June, the Stocherkahn race turns the town into a festive carnival. A vibrant farmers' market fills the Marktplatz every Saturday morning.\n\nLocals and students alike enjoy punting boats called Stocherkähne. Autumn paints the surrounding Schönbuch forest in fiery reds. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The colourful façades along the riverfront are a photographer's dream. Tübingen sits picturesquely on the Neckar River. Tübingen sits picturesquely on the Neckar River. Every June, the Stocherkahn race turns the town into a festive carnival. The Hölderlin Tower commemorates the Romantic poet who lived here. Philosopher Hegel once studied within these very streets."}
{"doc_id": "D077", "text": "The colourful façades along the riverfront are a photographer's dream. The town's mix of medieval timber‑frame houses and modern labs is striking. The town's mix of medieval timber‑frame houses and modern labs is striking. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Locals and students alike enjoy punting boats called Stocherkähne. Cyclists weave through the old town, where cars are largely forbidden. The colourful façades along the riverfront are a photographer's dream. Autumn paints the surrounding Schönbuch forest in fiery reds. Autumn paints the surrounding Schönbuch forest in fiery reds. The colourful façades along the riverfront are a photographer's dream.\n\nTübingen sits picturesquely on the Neckar River. The Hölderlin Tower commemorates the Romantic poet who lived here. Winters are chilly but Christmas lights make the streets glow warmly. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The observatory atop the castle hill hosts public stargazing nights. Winters are chilly but Christmas lights make the streets glow warmly. Autumn paints the surrounding Schönbuch forest in fiery reds. Every June, the Stocherkahn race turns the town into a festive carnival."}
{"doc_id": "D078", "text": "Tübingen sits picturesquely on the Neckar River. Tübingen sits picturesquely on the Neckar River. Winters are chilly but Christmas lights make the streets glow warmly. The Hölderlin Tower commemorates the Romantic poet who lived here. Cyclists weave through the old town, where cars are largely forbidden. Cyclists weave through the old town, where cars are largely forbidden. Tübingen sits picturesquely on the Neckar River. The Hölderlin Tower commemorates the Romantic poet who lived here. Autumn paints the surrounding Schönbuch forest in fiery reds. Winters are chilly but Christmas lights make the streets glow warmly.\n\nLocals and students alike enjoy punting boats called Stocherkähne. The observatory atop the castle hill hosts public stargazing nights. The observatory atop the castle hill hosts public stargazing nights. Philosopher Hegel once studied within these very streets. Tübingen sits picturesquely on the Neckar River."}
{"doc_id": "D079", "text": "The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Cyclists weave through the old town, where cars are largely forbidden. Autumn paints the surrounding Schönbuch forest in fiery reds. Winters are chilly but Christmas lights make the streets glow warmly. Cyclists weave through the old town, where cars are largely forbidden. The Hölderlin Tower commemorates the Romantic poet who lived here. Cyclists weave through the old town, where cars are largely forbidden. The observatory atop the castle hill hosts public stargazing nights. The observatory atop the castle hill hosts public stargazing nights.\n\nTübingen sits picturesquely on the Neckar River. Cyclists weave through the old town, where cars are largely forbidden. Locals and students alike enjoy punting boats called Stocherkähne. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Winters are chilly but Christmas lights make the streets glow warmly. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. A vibrant farmers' market fills the Marktplatz every Saturday morning."}
{"doc_id": "D080", "text": "The colourful façades along the riverfront are a photographer's dream. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Locals and students alike enjoy punting boats called Stocherkähne. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Winters are chilly but Christmas lights make the streets glow warmly. The town's mix of medieval timber‑frame houses and modern labs is striking. The town's mix of medieval timber‑frame houses and modern labs is striking. The colourful façades along the riverfront are a photographer's dream. Every June, the Stocherkahn race turns the town into a festive carnival. A vibrant farmers' market fills the Marktplatz every Saturday morning.\n\nA vibrant farmers' market fills the Marktplatz every Saturday morning. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. A vibrant farmers' market fills the Marktplatz every Saturday morning. Philosopher Hegel once studied within these very streets. Autumn paints the surrounding Schönbuch forest in fiery reds. A vibrant farmers' market fills the Marktplatz every Saturday morning. Autumn paints the surrounding Schönbuch forest in fiery reds."}
{"doc_id": "D081", "text": "A vibrant farmers' market fills the Marktplatz every Saturday morning. The colourful façades along the riverfront are a photographer's dream. The town's mix of medieval timber‑frame houses and modern labs is striking. Winters are chilly but Christmas lights make the streets glow warmly. Locals and students alike enjoy punting boats called Stocherkähne.\n\nWinters are chilly but Christmas lights make the streets glow warmly. Every June, the Stocherkahn race turns the town into a festive carnival. The town's mix of medieval timber‑frame houses and modern labs is striking. Winters are chilly but Christmas lights make the streets glow warmly. Locals and students alike enjoy punting boats called Stocherkähne. Autumn paints the surrounding Schönbuch forest in fiery reds. Locals and students alike enjoy punting boats called Stocherkähne."}
{"doc_id": "D082", "text": "The Hölderlin Tower commemorates the Romantic poet who lived here. The colourful façades along the riverfront are a photographer's dream. Autumn paints the surrounding Schönbuch forest in fiery reds. Cyclists weave through the old town, where cars are largely forbidden. Tübingen sits picturesquely on the Neckar River. A vibrant farmers' market fills the Marktplatz every Saturday morning. Tübingen sits picturesquely on the Neckar River. Tübingen sits picturesquely on the Neckar River. Philosopher Hegel once studied within these very streets. The town's mix of medieval timber‑frame houses and modern labs is striking.\n\nLocals and students alike enjoy punting boats called Stocherkähne. Locals and students alike enjoy punting boats called Stocherkähne. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The colourful façades along the riverfront are a photographer's dream. The observatory atop the castle hill hosts public stargazing nights. The university dates back to the 15th century and shapes the town's rhythm. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee."}
{"doc_id": "D083", "text": "A vibrant farmers' market fills the Marktplatz every Saturday morning. Philosopher Hegel once studied within these very streets. The colourful façades along the riverfront are a photographer's dream. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The Hölderlin Tower commemorates the Romantic poet who lived here. The observatory atop the castle hill hosts public stargazing nights. A vibrant farmers' market fills the Marktplatz every Saturday morning. Locals and students alike enjoy punting boats called Stocherkähne.\n\nThe university dates back to the 15th century and shapes the town's rhythm. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The observatory atop the castle hill hosts public stargazing nights. Cyclists weave through the old town, where cars are largely forbidden. The Hölderlin Tower commemorates the Romantic poet who lived here. Philosopher Hegel once studied within these very streets. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Philosopher Hegel once studied within these very streets."}
{"doc_id": "D084", "text": "Cyclists weave through the old town, where cars are largely forbidden. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The colourful façades along the riverfront are a photographer's dream. Philosopher Hegel once studied within these very streets. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The university dates back to the 15th century and shapes the town's rhythm. Autumn paints the surrounding Schönbuch forest in fiery reds. The observatory atop the castle hill hosts public stargazing nights.\n\nCafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The observatory atop the castle hill hosts public stargazing nights. A vibrant farmers' market fills the Marktplatz every Saturday morning. The colourful façades along the riverfront are a photographer's dream. Locals and students alike enjoy punting boats called Stocherkähne. Tübingen sits picturesquely on the Neckar River. The Hölderlin Tower commemorates the Romantic poet who lived here."}
{"doc_id": "D085", "text": "The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The colourful façades along the riverfront are a photographer's dream. The Hölderlin Tower commemorates the Romantic poet who lived here. Every June, the Stocherkahn race turns the town into a festive carnival. Autumn paints the surrounding Schönbuch forest in fiery reds. The colourful façades along the riverfront are a photographer's dream. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee.\n\nCafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Locals and students alike enjoy punting boats called Stocherkähne. The colourful façades along the riverfront are a photographer's dream. Cyclists weave through the old town, where cars are largely forbidden."}
{"doc_id": "D086", "text": "Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Tübingen sits picturesquely on the Neckar River. Tübingen sits picturesquely on the Neckar River. The town's mix of medieval timber‑frame houses and modern labs is striking. Cyclists weave through the old town, where cars are largely forbidden. Autumn paints the surrounding Schönbuch forest in fiery reds. Locals and students alike enjoy punting boats called Stocherkähne. Locals and students alike enjoy punting boats called Stocherkähne. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The town's mix of medieval timber‑frame houses and modern labs is striking.\n\nPhilosopher Hegel once studied within these very streets. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Winters are chilly but Christmas lights make the streets glow warmly. Locals and students alike enjoy punting boats called Stocherkähne. The colourful façades along the riverfront are a photographer's dream. Locals and students alike enjoy punting boats called Stocherkähne. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Winters are chilly but Christmas lights make the streets glow warmly."}
{"doc_id": "D087", "text": "The university dates back to the 15th century and shapes the town's rhythm. The town's mix of medieval timber‑frame houses and modern labs is striking. The observatory atop the castle hill hosts public stargazing nights. The observatory atop the castle hill hosts public stargazing nights. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Locals and students alike enjoy punting boats called Stocherkähne. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Every June, the Stocherkahn race turns the town into a festive carnival.\n\nThe Hölderlin Tower commemorates the Romantic poet who lived here. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The university dates back to the 15th century and shapes the town's rhythm. The Hölderlin Tower commemorates the Romantic poet who lived here. The town's mix of medieval timber‑frame houses and modern labs is striking. Autumn paints the surrounding Schönbuch forest in fiery reds."}
{"doc_id": "D088", "text": "The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The Hölderlin Tower commemorates the Romantic poet who lived here. Tübingen sits picturesquely on the Neckar River. Every June, the Stocherkahn race turns the town into a festive carnival. Every June, the Stocherkahn race turns the town into a festive carnival.\n\nThe colourful façades along the riverfront are a photographer's dream. The town's mix of medieval timber‑frame houses and modern labs is striking. Tübingen sits picturesquely on the Neckar River. Winters are chilly but Christmas lights make the streets glow warmly. The Hölderlin Tower commemorates the Romantic poet who lived here."}
{"doc_id": "D089", "text": "Locals and students alike enjoy punting boats called Stocherkähne. Tübingen sits picturesquely on the Neckar River. Autumn paints the surrounding Schönbuch forest in fiery reds. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Cyclists weave through the old town, where cars are largely forbidden. Every June, the Stocherkahn race turns the town into a festive carnival.\n\nCyclists weave through the old town, where cars are largely forbidden. Cyclists weave through the old town, where cars are largely forbidden. Tübingen sits picturesquely on the Neckar River. Cyclists weave through the old town, where cars are largely forbidden. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The Hölderlin Tower commemorates the Romantic poet who lived here. Tübingen sits picturesquely on the Neckar River."}
{"doc_id": "D090", "text": "The colourful façades along the riverfront are a photographer's dream. The university dates back to the 15th century and shapes the town's rhythm. Winters are chilly but Christmas lights make the streets glow warmly. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The Hölderlin Tower commemorates the Romantic poet who lived here. The Hölderlin Tower commemorates the Romantic poet who lived here. Every June, the Stocherkahn race turns the town into a festive carnival. Cyclists weave through the old town, where cars are largely forbidden. The town's mix of medieval timber‑frame houses and modern labs is striking.\n\nCyclists weave through the old town, where cars are largely forbidden. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The university dates back to the 15th century and shapes the town's rhythm. The university dates back to the 15th century and shapes the town's rhythm. Philosopher Hegel once studied within these very streets. The town's mix of medieval timber‑frame houses and modern labs is striking. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The Hölderlin Tower commemorates the Romantic poet who lived here. Tübingen sits picturesquely on the Neckar River."}
{"doc_id": "D091", "text": "Every June, the Stocherkahn race turns the town into a festive carnival. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The Hölderlin Tower commemorates the Romantic poet who lived here. Locals and students alike enjoy punting boats called Stocherkähne. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Every June, the Stocherkahn race turns the town into a festive carnival. Tübingen sits picturesquely on the Neckar River. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. A vibrant farmers' market fills the Marktplatz every Saturday morning. Autumn paints the surrounding Schönbuch forest in fiery reds.\n\nThe observatory atop the castle hill hosts public stargazing nights. Tübingen sits picturesquely on the Neckar River. The town's mix of medieval timber‑frame houses and modern labs is striking. The observatory atop the castle hill hosts public stargazing nights. Locals and students alike enjoy punting boats called Stocherkähne."}
{"doc_id": "D092", "text": "Locals and students alike enjoy punting boats called Stocherkähne. Autumn paints the surrounding Schönbuch forest in fiery reds. The colourful façades along the riverfront are a photographer's dream. Locals and students alike enjoy punting boats called Stocherkähne. A vibrant farmers' market fills the Marktplatz every Saturday morning. The Hölderlin Tower commemorates the Romantic poet who lived here. The observatory atop the castle hill hosts public stargazing nights. Tübingen sits picturesquely on the Neckar River.\n\nThe Neckarinsel becomes a picnic hotspot as soon as spring arrives. The town's mix of medieval timber‑frame houses and modern labs is striking. Tübingen sits picturesquely on the Neckar River. A vibrant farmers' market fills the Marktplatz every Saturday morning. Every June, the Stocherkahn race turns the town into a festive carnival. The colourful façades along the riverfront are a photographer's dream. Every June, the Stocherkahn race turns the town into a festive carnival. Philosopher Hegel once studied within these very streets. Winters are chilly but Christmas lights make the streets glow warmly."}
{"doc_id": "D093", "text": "Locals and students alike enjoy punting boats called Stocherkähne. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The university dates back to the 15th century and shapes the town's rhythm. The Hölderlin Tower commemorates the Romantic poet who lived here. The colourful façades along the riverfront are a photographer's dream. Every June, the Stocherkahn race turns the town into a festive carnival.\n\nA vibrant farmers' market fills the Marktplatz every Saturday morning. The colourful façades along the riverfront are a photographer's dream. The observatory atop the castle hill hosts public stargazing nights. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The university dates back to the 15th century and shapes the town's rhythm. Autumn paints the surrounding Schönbuch forest in fiery reds. The university dates back to the 15th century and shapes the town's rhythm. The colourful façades along the riverfront are a photographer's dream. Cyclists weave through the old town, where cars are largely forbidden. The Neckarinsel becomes a picnic hotspot as soon as spring arrives."}
{"doc_id": "D094", "text": "The town's mix of medieval timber‑frame houses and modern labs is striking. Winters are chilly but Christmas lights make the streets glow warmly. The Hölderlin Tower commemorates the Romantic poet who lived here. Philosopher Hegel once studied within these very streets. Cyclists weave through the old town, where cars are largely forbidden. Philosopher Hegel once studied within these very streets.\n\nAutumn paints the surrounding Schönbuch forest in fiery reds. The observatory atop the castle hill hosts public stargazing nights. The colourful façades along the riverfront are a photographer's dream. Autumn paints the surrounding Schönbuch forest in fiery reds. Cyclists weave through the old town, where cars are largely forbidden."}
{"doc_id": "D095", "text": "The Hölderlin Tower commemorates the Romantic poet who lived here. Every June, the Stocherkahn race turns the town into a festive carnival. A vibrant farmers' market fills the Marktplatz every Saturday morning. The observatory atop the castle hill hosts public stargazing nights. Winters are chilly but Christmas lights make the streets glow warmly.\n\nEvery June, the Stocherkahn race turns the town into a festive carnival. Autumn paints the surrounding Schönbuch forest in fiery reds. The Hölderlin Tower commemorates the Romantic poet who lived here. The town's mix of medieval timber‑frame houses and modern labs is striking. Locals and students alike enjoy punting boats called Stocherkähne. Autumn paints the surrounding Schönbuch forest in fiery reds. A vibrant farmers' market fills the Marktplatz every Saturday morning. The colourful façades along the riverfront are a photographer's dream. The colourful façades along the riverfront are a photographer's dream. Winters are chilly but Christmas lights make the streets glow warmly."}
{"doc_id": "D096", "text": "Locals and students alike enjoy punting boats called Stocherkähne. Autumn paints the surrounding Schönbuch forest in fiery reds. Autumn paints the surrounding Schönbuch forest in fiery reds. The colourful façades along the riverfront are a photographer's dream. Locals and students alike enjoy punting boats called Stocherkähne. Winters are chilly but Christmas lights make the streets glow warmly. Every June, the Stocherkahn race turns the town into a festive carnival. Winters are chilly but Christmas lights make the streets glow warmly. Cyclists weave through the old town, where cars are largely forbidden.\n\nTübingen sits picturesquely on the Neckar River. The colourful façades along the riverfront are a photographer's dream. Autumn paints the surrounding Schönbuch forest in fiery reds. Locals and students alike enjoy punting boats called Stocherkähne. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Cyclists weave through the old town, where cars are largely forbidden."}
{"doc_id": "D097", "text": "Locals and students alike enjoy punting boats called Stocherkähne. Winters are chilly but Christmas lights make the streets glow warmly. The town's mix of medieval timber‑frame houses and modern labs is striking. The Hölderlin Tower commemorates the Romantic poet who lived here. A vibrant farmers' market fills the Marktplatz every Saturday morning. Every June, the Stocherkahn race turns the town into a festive carnival. Tübingen sits picturesquely on the Neckar River. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. A vibrant farmers' market fills the Marktplatz every Saturday morning. The colourful façades along the riverfront are a photographer's dream.\n\nThe observatory atop the castle hill hosts public stargazing nights. The Hölderlin Tower commemorates the Romantic poet who lived here. The Hölderlin Tower commemorates the Romantic poet who lived here. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Locals and students alike enjoy punting boats called Stocherkähne. Winters are chilly but Christmas lights make the streets glow warmly."}
{"doc_id": "D098", "text": "The Hölderlin Tower commemorates the Romantic poet who lived here. The colourful façades along the riverfront are a photographer's dream. The observatory atop the castle hill hosts public stargazing nights. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Cyclists weave through the old town, where cars are largely forbidden. The Hölderlin Tower commemorates the Romantic poet who lived here. The university dates back to the 15th century and shapes the town's rhythm. Autumn paints the surrounding Schönbuch forest in fiery reds.\n\nThe town's mix of medieval timber‑frame houses and modern labs is striking. The observatory atop the castle hill hosts public stargazing nights. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee. Every June, the Stocherkahn race turns the town into a festive carnival. Locals and students alike enjoy punting boats called Stocherkähne. Philosopher Hegel once studied within these very streets. Every June, the Stocherkahn race turns the town into a festive carnival. Locals and students alike enjoy punting boats called Stocherkähne."}
{"doc_id": "D099", "text": "The observatory atop the castle hill hosts public stargazing nights. Locals and students alike enjoy punting boats called Stocherkähne. Locals and students alike enjoy punting boats called Stocherkähne. Autumn paints the surrounding Schönbuch forest in fiery reds. Winters are chilly but Christmas lights make the streets glow warmly.\n\nTübingen sits picturesquely on the Neckar River. The colourful façades along the riverfront are a photographer's dream. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. The town's mix of medieval timber‑frame houses and modern labs is striking. The Neckarinsel becomes a picnic hotspot as soon as spring arrives. Cyclists weave through the old town, where cars are largely forbidden. Autumn paints the surrounding Schönbuch forest in fiery reds. Autumn paints the surrounding Schönbuch forest in fiery reds. Tübingen sits picturesquely on the Neckar River."}
{"doc_id": "D100", "text": "Winters are chilly but Christmas lights make the streets glow warmly. Autumn paints the surrounding Schönbuch forest in fiery reds. The town's mix of medieval timber‑frame houses and modern labs is striking. Cyclists weave through the old town, where cars are largely forbidden. Cafés spill onto cobblestone alleys offering Swabian pretzels and coffee.\n\nCafés spill onto cobblestone alleys offering Swabian pretzels and coffee. The Hölderlin Tower commemorates the Romantic poet who lived here. The observatory atop the castle hill hosts public stargazing nights. A vibrant farmers' market fills the Marktplatz every Saturday morning. Autumn paints the surrounding Schönbuch forest in fiery reds. The Hölderlin Tower commemorates the Romantic poet who lived here."}
